w6d3/routes_and_controllers/app/controllers/artworks_controller.rb

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def index
    artworks_owned = Artwork.find_by(id: params[:id])

SELECT  "artworks".* FROM "artworks" WHERE "artworks"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def update
    artwork = Artwork.find_by(id: params[:id])