w6d3/routes_and_controllers/app/controllers/artwork_shares_controller.rb

  def create
    share = ArtworkShare.new(params.require(:artwork_share).permit(:artwork_id, :viewer_id))
    if share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 5], ["viewer_id", 3], ["created_at", "2021-02-26 01:04:22.452312"], ["updated_at", "2021-02-26 01:04:22.452312"]]